In [3]:
a=1
b=2
c=a+b
print(c)

3

In [ ]:
-pandas:used for database reading writing the data
-numpy:used for numerical or math operations
-matploting:used for plotting
-seborn:used for plotting

In [ ]:
======================EDA STEPS======================================
---------------------DATA CLEANING AND ANALYSIS----------------------

1) read the data 
2)create categorical and numerical columns 
3)data quick check
  a)shape b)size c)len d) head e) tail f)info
4)missing value analysis
5)data quality check or data cleaning 
  ex :some column  value has some punctuations
      columns is numerical value
      but some where cat value avaliable
6)categorical column ananlysis
  a)frequancy table b) relative frequency 
  c) bar chat     d) pie chat
7) numerical column analysis
   a) statics summery b) histogram 
    data disrtrubation
8) outlier analysis
  a) box plot b) treat the outlier
9) bi varient and multi varient ananlysis
   a) how one column impact other column
   b) correleation   c)heatmaps
10) encoding :convert to numerical 
   a) label encoder b)onehot encoder
11)scalling:
   a) standerdization and  b) normalization
12)transformation (optional)
-----------------------------FEACTURE SELECTION----------------
13)selecting the important for ml models
-----------------------------DIMENSION REDUCTION METHODA--------
14)principle complete analysis
  singu;ar value decomposition 
-----------------------------DEVELOP THE ML MODEL---------------

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seborn as sns

ModuleNotFoundError: No module named 'seborn'

**step-2:create dataframe using list**

In [4]:
import pandas as pd
names=['ramesh','suresh','satish']
#pd.DataFrame(data,index,column)
pd.DataFrame(names)

        0
0  ramesh
1  suresh
2  satish

**step-3:add column**

In [7]:
names=['ramesh','suresh','satish']
pd.DataFrame(names,columns=['names'])

    names
0  ramesh
1  suresh
2  satish

**step-4:update the index**

In [15]:
names=['ramesh','suresh','satish']
pd.DataFrame(names,index=['A','B','C'])

        0
A  ramesh
B  suresh
C  satish

In [14]:
names=['ramesh','suresh','satish']
pd.DataFrame(names,index=['A','B','C'])

        0
A  ramesh
B  suresh
C  satish

In [23]:
import pandas as pd
names=['sanjay','sudop']
city=['mumbai','pune']
data=list(zip(names,city))
idx=['A','B']
col=['names','city']
pd.DataFrame(data,index=idx,columns=col)

    names    city
A  sanjay  mumbai
B   sudop    pune

In [39]:

names=['ramesh','suresh','satish']
city=['mumbai','udgir','hyd']
data=list(zip(names,city))
cols=['names','city']
idx=['A','B','C']
pd.DataFrame(data,index=idx,columns=cols)#,index=idx,columns=cols)

    names    city
A  ramesh  mumbai
B  suresh   udgir
C  satish     hyd

**step-5:create dataframe with multiple column**

In [43]:
names=['ramesh','suresh','satish']
city=['mumbai','udgir','hyd']
data=[names,city]

cols=['names','city']
idx=['A','B','C']
pd.DataFrame(data,index=cols,columns=idx).T

    names    city
A  ramesh  mumbai
B  suresh   udgir
C  satish     hyd

In [41]:
names=['sanjay','rajofj']
city=['pu','isd']
data=zip(names,city)
index=['A','B']
columns=['names','city']
pd.DataFrame(data,index,columns).T

            A       B
names  sanjay  rajofj
city       pu     isd

In [39]:
names=['ramesh','suresh','satish']
city=['mumbai','udgir','hyd']
data=zip(names,city)

cols=['names','city']
idx=['A','B','C']
pd.DataFrame(data,index=idx,columns=cols)

    names    city
A  ramesh  mumbai
B  suresh   udgir
C  satish     hyd

In [15]:
import pandas as pd
names=['ramesh','suresh','satish']
city=['mumbai','udgir','hyd']

ages=[20,22,29]
data=zip(names,city,ages)
cols=['names','city','ages']
idx=['A','B','C']
pd.DataFrame(data,index=idx,columns=cols)

    names    city  ages
A  ramesh  mumbai    20
B  suresh   udgir    22
C  satish     hyd    29

**step-6:hpw to adddata to empty dataframe**

In [3]:
l=[]
l.append(20)
l
d={}
d['names']='ramesh'
d
s=''
s=s+'apple'
s

'apple'

In [49]:
df=pd.DataFrame()
df['names']=['ramesh','suresh','satish']
df['age']=[20,22,29]
df['city']=['mumbai','hyd','ban']
df

    names  age    city
0  ramesh   20  mumbai
1  suresh   22     hyd
2  satish   29     ban

In [57]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
data=pd.DataFrame(d)
data.columns=['A','B','C']

        A   B       C
0  ramesh  20  mumbai
1  suresh  22     hyd
2  satish  29     blr

**step-7:create a dtaframe using dictonary**

In [7]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df

    names  ages    city
0  ramesh    20  mumbai
1  suresh    22     hyd
2  satish    29     blr

**step-8:**

In [ ]:
-shape
-size
-column
-dtypes
-isnull

In [93]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df

    names  ages    city
0  ramesh    20  mumbai
1  suresh    22     hyd
2  satish    29     blr

In [76]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df.shape

(3, 3)

In [78]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df.size

9

In [86]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df.columns

Index(['names', 'ages', 'city'], dtype='object')

In [82]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df.dtypes

names    object
ages      int64
city     object
dtype: object

In [88]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df.isnull()

   names   ages   city
0  False  False  False
1  False  False  False
2  False  False  False

In [90]:
#column wise null value not avaliable
df.isnull().sum()

names    0
ages     0
city     0
dtype: int64

**step-9:rename the column**

In [67]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df.columns=['A','B','C']   # rename the column
d={0:1,1:2,2:3}
df.rename(d
df

        A   B       C     D
0  ramesh  20  mumbai   dew
1  suresh  22     hyd  efef
2  satish  29     blr  FRGR

In [131]:
df.index=['A','B','C']
df

        A   B       C
A  ramesh  20  mumbai
B  suresh  22     hyd
C  satish  29     blr

In [ ]:
df.rename(mapper,index,columns,axis,inplace)

In [133]:
d={'names':'A','age':'B','city':'C'}
df.rename(columns=d,inplace=True)
df

        A   B       C
A  ramesh  20  mumbai
B  suresh  22     hyd
C  satish  29     blr

In [59]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
d={0:'A',1:'B',2:'C'}
df.rename(index=d,inplace=True)
df

    names  ages    city
A  ramesh    20  mumbai
B  suresh    22     hyd
C  satish    29     blr

In [31]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
d={0:'A',1:'B',2:'C'}
df.rename(d,inplace=True) #bydefault 
df

    names  ages    city
A  ramesh    20  mumbai
B  suresh    22     hyd
C  satish    29     blr

In [129]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
d={0:'A',1:'B',2:'C'}
df.rename(d,inplace=True) #bydefault 
df
df.rename(d,
          axis=1,
          inplace=True)
df

    names  ages    city
A  ramesh    20  mumbai
B  suresh    22     hyd
C  satish    29     blr

**step-10:how to modify**

In [31]:
d={'names':['ramesh','suresh','satish'],
   'ages':[20,22,29],   
   'city':['mumbai','hyd','blr']}
df=pd.DataFrame(d)
df['marks']=[100,200,300]
df['ages']=[10,29,49]
df

    names  ages    city  marks
0  ramesh    10  mumbai    100
1  suresh    29     hyd    200
2  satish    49     blr    300

**step-11:save the data frame**
-if we want to read or write we need 3 values
   -where you want to save
   -on which name you want to save
   -on which format you want to save
-filename.txt
-fileaname.csv of filename.xlsx
-if i provide only file name it will save at cwd

In [35]:
df

    names  ages    city  marks
0  ramesh    10  mumbai    100
1  suresh    29     hyd    200
2  satish    49     blr    300

In [49]:
df.to_csv('data.csv',index=False)

**step-2:read the data ferame**

In [51]:
pd.read_csv('data.csv')

    names  ages    city  marks
0  ramesh    10  mumbai    100
1  suresh    29     hyd    200
2  satish    49     blr    300